#  ===========================
# -*- coding:utf-8 -*-
# Time :2022/8/29 15:25
# Author :小灬天
# QQ:915155536
# File :menu_select.py
#  ===========================
from interface_base.base_session import BaseSession
from jsonpath import jsonpath

# 菜单查询接口
def user_select(conf):
    session = BaseSession(conf)
    # 1)准备接口url
    url = session.conf_url + 'menu'
    # 2）请求接口
    res = session.session.get(url=url)
    # 4）接口返回数据处理（断言）
    tag = res.json()['code']
    if tag == 200:
        session.logger.info('查询用户菜单，执行成功！')
        menu_name = jsonpath(res.json(), '$..name')
        session.logger.info(menu_name)
    else:
        session.logger.error(res.json())


if __name__ == '__main__':
    # 查询指定环境的用户菜单信息
    user_select('dev')

['工作台', '规则管理', '规则管理', '查询', '新增', '修改', '删除', '亲密度管理', '查询', '修改', '派工管理', '派工', '查询', '新增', '修改', '删除', '生效', '派工详情', '派工甘特图', '车辆班组右键', '航机班组右键', '派工KPI', '模拟调整', '模拟甘特图', '车辆班组右键', '航机班组右键', '查询', '修改', '删除', '生效', '实时监控', '修改', '基础信息', '人员岗位', '查询 ', '新增 ', '修改 ', '删除 ', '资质信息', '查询 ', '新增 ', '修改 ', '删除 ', '员工信息', '查询 ', '新增 ', '修改 ', '删除 ', '班组信息', '查询 ', '新增 ', '修改 ', '删除 ', '航班信息', '更新', '新增', '查询', '查询', '新增', '食品车信息', '查询 ', '新增 ', '修改 ', '删除 ', '航段信息', '查询 ', '新增 ', '修改 ', '删除 ', '区域机位', '查询 ', '新增 ', '修改 ', '删除 ', '车程信息', '查询 ', '新增 ', '修改 ', '删除 ', '班头', '查询', '新增', '修改', '删除', '员工工作时间', '查询 ', '新增 ', '修改 ', '系统管理', '用户管理', '查询 ', '新增 ', '修改 ', '重置密码 ', '删除 ', '角色管理', '查询 ', '新增 ', '修改 ', '删除 ', '字典值', '查询 ', '新增 ', '修改 ', '删除 ', '承运人', '查询 ', '新增 ', '修改 ', '删除 ', '机型系列', '查询 ', '新增 ', '修改 ', '删除 ', '机场信息', '查询 ', '新增 ', '修改 ', '删除 ', '航食公司', '新增', '删除', '修改', '查询', '系统设置', '查询 ', '新增 ', '修改 ', '删除 ', '版本控制', '新增', '查询']

